[
  {
    "id": 1,
    "role": "Backend Java Developer At Shop Online New York (USA)",
    "organisation": "Shop Online New York (USA)",
    "startDate": "March, 2022",
    "endDate": "August, 2022",
    "location": "Remote",
    "experiences": [
      "Developed and maintained RESTful APIs using Spring Boot for user authentication, product listings, and order processing.",
      "Collaborated with frontend teams to integrate backend services seamlessly.",
      "Conducted unit testing using JUnit and Mockito to ensure code quality and reliability.",
      "Debugged complex application issues to improve performance and functionality.",
      "Implemented CI/CD pipelines with GitHub Actions for automated testing and deployment."
    ],
    "imageSrc": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ2bqc654MlFUHEKVlX5hPBuLVha6521DZfsg&s"
  },
  {
    "id": 2,
    "role": "Software Developer At Upwork",
    "organisation": "Freelance (Upwork)",
    "startDate": "February, 2023",
    "endDate": "August, 2023",
    "location": "Remote",
    "experiences": [
      "Designed and developed a competency-based education website using React.js and Spring Boot.",
      "Utilized PostgreSQL to store and manage user data, learning materials, and progress tracking.",
      "Wrote unit tests with JUnit, Mockito, and Jest to ensure application reliability.",
      "Managed project workflows through Agile methodologies with JIRA.",
      "Integrated Spring Security for secure user authentication and authorization."
    ],
    "imageSrc": "https://cdn.shopify.com/s/files/1/2642/6578/articles/442269ac56eddaecd3fa3dd752c38870.jpg?v=1631828825"
  },
  {
    "id": 3,
    "role": "Software Developer At Indigo As",
    "organisation": "Indigo AS",
    "startDate": "August, 2024",
    "endDate": "Present",
    "location": "Remote",
    "experiences": [
      "Contributing to the 'Rented Art' project, a platform for artists to upload artwork for businesses to rent.",
      "Developed frontend pages using React Native and collaborated on backend features with Flask/Django.",
      "Implemented and maintained CI/CD pipelines for both frontend and backend using GitHub Actions.",
      "Managed SQL databases to store rental history, artwork details, and user interactions.",
      "Debugged and enhanced full-stack application functionality."
    ],
    "imageSrc": "https://seeklogo.com/images/I/indigo-logo-EDBB4B3C09-seeklogo.com.png"
  }
]



